<template>
  <v-about-item/>
  <div class="v-about">
    <div class="content">
      <div class="content__text black-font">
        <h1>Магазин запчастей для иномарок, коммерческого автотранспорта и грузовых автомобилей komandir13.ru </h1>
        <br>
        <h2>более 50 000 наименований автозапчастей в наличии</h2>
        <br>
        <p>для сервисного обслуживания иномарок, грузового, коммерческого автотранспорта, а также для всех видов спецтехники: салонные и воздушные фильтры; тормозные колодки, диски барабаны; детали двигателя (ремни, ролики ГРМ, свечи зажигания); щётки стеклоочистителя (автомобильные дворники); автомасла и автохимия; аксессуары и другие запчасти для ТО</p>
        <br>
        <div class="content__items">
          <div
            v-for="list in lists"
            :key="list.id"
            class="item"
          >
            <img class="margin-right" src="@/assets/images/icons/ok.svg" alt="#">
            <span>{{ list.content }}</span>
          </div>
        </div>
        <br>
        <p>
          Возможность заказа автозапчастей по VIN коду автомобиля, по номеру запчасти в каталоге производителя.
        </p>
        <br>
        <p>
          Оригинальные запчасти для иномарок, коммерческого автотранспорта и грузовых автомобилей и более дешёвые их аналоги (не оригинальные автозапчасти, не уступающие по качеству оригиналу). Цены на не оригинальные запчасти вас приятно обрадуют. Мы можем предложить низкие цены на запчасти для иномарок благодаря удобной и прогрессивной системе скидок.
        </p>
        <br>
        <p>
          Доставка товара до любой точки в Саранске и Республике Мордовия собственной логистической службой.
        </p>
        <br>
        <h3>К вашему распоряжению в магазине оригинальные каталоги запчастей:</h3>
        <br>
        <div class="content__items">
          <div
            v-for="other in others"
            :key="other.id"
            class="item"
          >
            <img class="margin-right" src="@/assets/images/icons/ok.svg" alt="">
            <span>{{ other.content }}</span>
          </div>
        </div>
        <br>
        <p>
          Совершая покупку запчастей для иномарок в Сарнске и Республике Мордовия, рекомендуем заглянуть в магазин «Командир» посмотреть наш ассортимент и сравнить цены с конкурентами.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import VAboutItem from '@/components/pages/v-about/v-about-item.vue';
export default {
  name: 'v-about',
  components:{
    VAboutItem
  },
  data(){
    return{
      lists:[
        {
          id:1,
          content: 'детали подвески (тормозные колодки тормозные диски, амортизаторы, пружины, рычаги, сайлентблоки, шаровые опоры)'
        },
        {
          id:2,
          content: 'запчасти для ремонта ходовой (подшипники, ступицы, ШРУС)'
        },
        {
          id:3,
          content: 'кузовные детали (бамперы, крылья, решётки, двери, капоты)'
        },
        {
          id:4,
          content: ' автомобильная оптика (фары, фонари, лампы, указатели поворотов, зеркала заднего вида)'
        },
        {
          id:5,
          content: 'детали для капитального ремонта двигателя (поршня, шатуны, вкладыши, прокладки, маслосъёмные колпачки)'
        },
        {
          id:6,
          content: 'автомобильные аккумуляторы, диски, шины, автоакссесуары'
        },
      ],
      others:[
        {
          id:1,
          content:'Немецких иномарок: Ауди, Фольксваген, Мерседес, Опель, БМВ, Порше, Ман (MAN)'
        },
        {
          id:2,
          content:'Европейских автомобилей: Рено, Пежо, Ситроен, Шкода, Вольво, Фиат, Альфа Ромео, Ивеко (IVECO), Скания (SCANIA), Даф (DAF)'
        },
        {
          id:3,
          content:'Японских авто: Сузуки, Субару, Тойота, Нисcан, Хонда, Мазда, Митцубиси, Лексус, Инфинити, Акура, Исузу (ISUZU), Хино (HINO), Дайхатцу (DAIHATSU)'
        },
        {
          id:4,
          content:'Других машины из стран Азии: Хендай, Хавал, Джили, Лифан, Киа, СсангЙонг, Дэу, Фау (FAW), Фотон (FOTON), Хау (HOWO), Джак (JAC), Шангси (SHAANXI)'
        },
        {
          id:5,
          content:'Американских транспортных средств: Шевролет Форд, Додж, Крайслер, Джип, Кадиллак, Фретлайнер (FREIGHTLINER) и др.'
        },
      ]
    }
  }
}
</script>

<style scoped lang="scss">
  .v-about{
    display: flex;
    align-items: center;
    justify-content: center;
    margin: 5% 0 5% 0;
  }
  .content{
    width: 100%;
    margin: 0 10% 0 10%;
    display: flex;
    flex-direction: column;
    align-items: center;

    &__text{
      text-align: start;
    }
    &__items{
    }
  }
  .item{
    display: flex;
    align-items: center;
    justify-content: start;
    margin-bottom: 2%;
  }
</style>
